Test/test.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-28 Wed 11:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A reproducible comparison between  GNU MPFR and machine double-precision</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Paul Zimmermann (reproduction with org-mode by Arnaud Legrand)" />
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">A reproducible comparison between  GNU MPFR and machine double-precision</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1bcb201">1. Reproducible Experimental Setup</a>
<ul>
<li><a href="#org0655e8d">1.1. Experimental Results From Arnaud Legrand</a>
<ul>
<li><a href="#orgf2c06d9">1.1.1. Code</a></li>
<li><a href="#orgbb94b05">1.1.2. Setup</a></li>
<li><a href="#org681a464">1.1.3. A first measurement</a></li>
<li><a href="#org42e0b70">1.1.4. A second measurement</a></li>
</ul>
</li>
<li><a href="#org7c6e629">1.2. References</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Local version
</p>

<p>
Several authors claim that GNU MPFR [1] is \(x\) times slower than
double-precision floating-point numbers, for various values of \(x\),
without any way for the reader to reproduce their claim. For example
in [2], Joris van der Hoeven writes “the MPFR library for arbitrary
precision and IEEE-style standardized floating-point arithmetic is
typically about a factor 100 slower than double precision machine
arithmetic”. Such a claim typically: (i) does not say which version of
MPFR was used (and which version of GMP, since MPFR being based on
GMP, its efficiency also depends on GMP); (ii) does not detail the
environment used (processor, compiler, operating system); (iii) does
not explain which application was used for the comparison. Therefore
it cannot be reproduced by the reader, which could thus have no
confidence in the claimed factor of 100. In this short note we provide
reproducible figures that can be checked by the reader.
</p>

<div id="outline-container-org1bcb201" class="outline-2">
<h2 id="org1bcb201"><span class="section-number-2">1</span> Reproducible Experimental Setup</h2>
<div class="outline-text-2" id="text-1">
<p>
We use the programs in appendix to multiply two \(1000 × 1000\)
matrices. The matrix \(A\) has coefficients \(1/(i + j + 1)\) for \(0 ≤ i,
j < 1000\), and matrix \(b\) has coefficients \(1/(ij + 1)\). Both programs
print the time for the matrix product (not counting the time to
initialize the matrix), and the sum of coefficients of the product
matrix (used as a simple checksum between both programs).  
</p>

<p>
We used MFPR version 3.1.5, configured with GMP 6.1.2 (both are the
latest releases as of the date of this document).  
</p>

<p>
We used as test processor <code>gcc12.fsffrance.org</code>, which is a machine from
the GCC Compile Farm, a set of machines available for developers of
free software. The compiler used was GCC 4.5.1, which is installed in
<code>/opt/cfarm/release/4.5.1</code> on this machine, with optimization level
<code>-O3</code>. Both GMP and MPFR were also compiled with this compiler, and the
GMP and MPFR libraries were linked statically with the application
programs (given in appendix).
</p>
</div>

<div id="outline-container-org0655e8d" class="outline-3">
<h3 id="org0655e8d"><span class="section-number-3">1.1</span> Experimental Results From Arnaud Legrand</h3>
<div class="outline-text-3" id="text-1-1">
</div>
