Test/test.html
<div id="outline-container-orgf2c06d9" class="outline-4">
<h4 id="orgf2c06d9"><span class="section-number-4">1.1.1</span> Code</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
The program (<code>a.c</code>) using the C double-precision type is the
following. It takes as command-line argument the matrix dimension.
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #808080;">#include</span> <span style="color: #008000;">&lt;stdio.h&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #008000;">&lt;stdlib.h&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #008000;">&lt;sys/types.h&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #008000;">&lt;sys/resource.h&gt;</span> 

<span style="color: #0000FF;">static</span> <span style="color: #6434A3;">int</span> <span style="color: #006699;">cputime</span>()
{
  <span style="color: #0000FF;">struct</span> <span style="color: #6434A3;">rusage</span> <span style="color: #BA36A5;">rus</span>;
  getrusage(0, &amp;rus);
  <span style="color: #0000FF;">return</span> rus.ru_utime.tv_sec * 1000 + rus.ru_utime.tv_usec / 1000;
}

<span style="color: #6434A3;">int</span> <span style="color: #006699;">main</span>(<span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">argc</span>, <span style="color: #6434A3;">char</span> *<span style="color: #BA36A5;">argv</span>[])
{
  <span style="color: #6434A3;">double</span> **<span style="color: #BA36A5;">a</span>;
  <span style="color: #6434A3;">double</span> **<span style="color: #BA36A5;">b</span>;
  <span style="color: #6434A3;">double</span> **<span style="color: #BA36A5;">c</span>;
  <span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">t</span> = 0.0;
  <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span>, <span style="color: #BA36A5;">j</span>, <span style="color: #BA36A5;">k</span>, <span style="color: #BA36A5;">st</span>;
  <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">N</span> = atoi(argv[1]);
  st = cputime();
  a = malloc(<span style="color: #6434A3;">N</span> * <span style="color: #0000FF;">sizeof</span>(<span style="color: #6434A3;">double</span> *));
  b = malloc(<span style="color: #6434A3;">N</span> * <span style="color: #0000FF;">sizeof</span>(<span style="color: #6434A3;">double</span> *));
  c = malloc(<span style="color: #6434A3;">N</span> * <span style="color: #0000FF;">sizeof</span>(<span style="color: #6434A3;">double</span> *));
  <span style="color: #0000FF;">for</span> (i = 0; i &lt; N; i++) {
    a[i] = malloc(<span style="color: #6434A3;">N</span> * <span style="color: #0000FF;">sizeof</span>(<span style="color: #6434A3;">double</span>));
    b[i] = malloc(<span style="color: #6434A3;">N</span> * <span style="color: #0000FF;">sizeof</span>(<span style="color: #6434A3;">double</span>));
    c[i] = malloc(<span style="color: #6434A3;">N</span> * <span style="color: #0000FF;">sizeof</span>(<span style="color: #6434A3;">double</span>));
    <span style="color: #0000FF;">for</span> (j = 0; j &lt; N; j++) {
      a[i][j] = 1.0 / (1.0 + i + j);
      b[i][j] = 1.0 / (1.0 + i * j);
    }
  }
  st = cputime();
  <span style="color: #0000FF;">for</span> (i = 0; i &lt; N; i++)
    <span style="color: #0000FF;">for</span> (j = 0; j &lt; N; j++)
      c[i][j] = 0.0;
  <span style="color: #0000FF;">for</span> (i = 0; i &lt; N; i++)
    <span style="color: #0000FF;">for</span> (k = 0; k &lt; N; k++)
      <span style="color: #0000FF;">for</span> (j = 0; j &lt; N; j++)
        c[i][j] += a[i][k] * b[k][j];
  <span style="color: #0000FF;">for</span> (i = 0; i &lt; N; i++)
    <span style="color: #0000FF;">for</span> (j = 0; j &lt; N; j++)
      t += c[i][j];
  printf(<span style="color: #008000;">"matrix product took %dms\n"</span>, cputime() - st);
  printf(<span style="color: #008000;">"t=%f\n"</span>, t);
  <span style="color: #0000FF;">for</span> (i = 0; i &lt; N; i++) {
    free(a[i]);
    free(b[i]);
    free(c[i]);
  }
  free(a);
  free(b);
  free(c);
  <span style="color: #0000FF;">return</span> 0;
}
</pre>
</div>

<p>
The program (<code>d.c</code>) using GNU MPFR is the following. It takes as
command-line argument the matrix dimension and the MPFR precision (in
bits).
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #808080;">#include</span> <span style="color: #008000;">&lt;stdio.h&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #008000;">&lt;stdlib.h&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #008000;">&lt;sys/types.h&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #008000;">&lt;sys/resource.h&gt;</span> 
<span style="color: #808080;">#include</span> <span style="color: #008000;">&lt;mpfr.h&gt;</span>

<span style="color: #0000FF;">static</span> <span style="color: #6434A3;">int</span> <span style="color: #006699;">cputime</span>()
{
  <span style="color: #0000FF;">struct</span> <span style="color: #6434A3;">rusage</span> <span style="color: #BA36A5;">rus</span>;
  getrusage(0, &amp;rus);
  <span style="color: #0000FF;">return</span> rus.ru_utime.tv_sec * 1000 + rus.ru_utime.tv_usec / 1000;
}

<span style="color: #6434A3;">int</span> <span style="color: #006699;">main</span>(<span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">argc</span>, <span style="color: #6434A3;">char</span> *<span style="color: #BA36A5;">argv</span>[])
{
  <span style="color: #6434A3;">mpfr_t</span> **<span style="color: #BA36A5;">a</span>;
  <span style="color: #6434A3;">mpfr_t</span> **<span style="color: #BA36A5;">b</span>;
  <span style="color: #6434A3;">mpfr_t</span> **<span style="color: #BA36A5;">c</span>;
  <span style="color: #6434A3;">mpfr_t</span> <span style="color: #BA36A5;">s</span>;
  <span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">t</span> = 0.0;
  <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span>, <span style="color: #BA36A5;">j</span>, <span style="color: #BA36A5;">k</span>, <span style="color: #BA36A5;">st</span>;
  <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">N</span> = atoi(argv[1]);
  <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">prec</span> = atoi(argv[2]);
  printf(<span style="color: #008000;">"MPFR library: %-12s\nMPFR header: %s (based on %d.%d.%d)\n"</span>,
         mpfr_get_version(), MPFR_VERSION_STRING, MPFR_VERSION_MAJOR,
         MPFR_VERSION_MINOR, MPFR_VERSION_PATCHLEVEL);
  st = cputime();
  a = malloc(<span style="color: #6434A3;">N</span> * <span style="color: #0000FF;">sizeof</span>(<span style="color: #6434A3;">mpfr_t</span> *));
  b = malloc(<span style="color: #6434A3;">N</span> * <span style="color: #0000FF;">sizeof</span>(<span style="color: #6434A3;">mpfr_t</span> *));
  c = malloc(<span style="color: #6434A3;">N</span> * <span style="color: #0000FF;">sizeof</span>(<span style="color: #6434A3;">mpfr_t</span> *));
  mpfr_init2(s, prec);
  <span style="color: #0000FF;">for</span> (i = 0; i &lt; N; i++) {
    a[i] = malloc(<span style="color: #6434A3;">N</span> * <span style="color: #0000FF;">sizeof</span>(mpfr_t));
    b[i] = malloc(<span style="color: #6434A3;">N</span> * <span style="color: #0000FF;">sizeof</span>(mpfr_t));
    c[i] = malloc(<span style="color: #6434A3;">N</span> * <span style="color: #0000FF;">sizeof</span>(mpfr_t));
    <span style="color: #0000FF;">for</span> (j = 0; j &lt; N; j++) {
      mpfr_init2(a[i][j], prec);
      mpfr_init2(b[i][j], prec);
      mpfr_init2(c[i][j], prec);
      mpfr_set_ui(a[i][j], 1, MPFR_RNDN);
      mpfr_div_ui(a[i][j], a[i][j], i + j + 1, MPFR_RNDN);
      mpfr_set_ui(b[i][j], 1, MPFR_RNDN);
      mpfr_div_ui(b[i][j], b[i][j], i * j + 1, MPFR_RNDN);
    }
  }
  st = cputime();
  <span style="color: #0000FF;">for</span> (i = 0; i &lt; N; i++)
    <span style="color: #0000FF;">for</span> (j = 0; j &lt; N; j++)
      mpfr_set_ui(c[i][j], 0, MPFR_RNDN);
  <span style="color: #0000FF;">for</span> (i = 0; i &lt; N; i++)
    <span style="color: #0000FF;">for</span> (k = 0; k &lt; N; k++)
      <span style="color: #0000FF;">for</span> (j = 0; j &lt; N; j++) {
        mpfr_mul(s, a[i][k], b[k][j], MPFR_RNDN);
        mpfr_add(c[i][j], c[i][j], s, MPFR_RNDN);
      }
  <span style="color: #0000FF;">for</span> (i = 0; i &lt; N; i++)
    <span style="color: #0000FF;">for</span> (j = 0; j &lt; N; j++)
      t += mpfr_get_d(c[i][j], MPFR_RNDN);
  printf(<span style="color: #008000;">"matrix product took %dms\n"</span>, cputime() - st);
  printf(<span style="color: #008000;">"t=%f\n"</span>, t);
  <span style="color: #0000FF;">for</span> (i = 0; i &lt; N; i++) {
    <span style="color: #0000FF;">for</span> (j = 0; j &lt; N; j++) {
      mpfr_clear(a[i][j]);
      mpfr_clear(b[i][j]);
      mpfr_clear(c[i][j]);
    }
    free(a[i]);
    free(b[i]);
    free(c[i]);
  }
  mpfr_clear(s);
  free(a);
  free(b);
  free(c);
  <span style="color: #0000FF;">return</span> 0;
}
</pre>
</div>
</div>
</div>
