Test/test.html

<div id="outline-container-orgbb94b05" class="outline-4">
<h4 id="orgbb94b05"><span class="section-number-4">1.1.2</span> Setup</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li><p>
Name of the machine and OS version:
</p>
<pre class="example">
Linux sama 4.2.0-1-amd64 #1 SMP Debian 4.2.6-1 (2015-11-10) x86_64 GNU/Linux

</pre></li>

<li><p>
CPU/architecture information:
</p>
<div class="org-src-container">
<pre class="src src-shell">  cat /proc/cpuinfo
</pre>
</div>

<pre class="example">
  processor	: 0
  vendor_id	: GenuineIntel
  cpu family	: 6
  model		: 58
  model name	: Intel(R) Core(TM) i7-3687U CPU @ 2.10GHz
  stepping	: 9
  microcode	: 0x15
  cpu MHz		: 2165.617
  cache size	: 4096 KB
  physical id	: 0
  siblings	: 4
  core id		: 0
  cpu cores	: 2
  apicid		: 0
  initial apicid	: 0
  fpu		: yes
  fpu_exception	: yes
  cpuid level	: 13
  wp		: yes
  flags		: fpu vme de pse tsc msr pae mce cx8 apic sep mtrr pge mca cmov pat pse36 clflush dts acpi mmx fxsr sse sse2 ss ht tm pbe syscall nx rdtscp lm constant_tsc arch_perfmon pebs bts rep_good nopl xtopology nonstop_tsc aperfmperf eagerfpu pni pclmulqdq dtes64 monitor ds_cpl vmx smx est tm2 ssse3 cx16 xtpr pdcm pcid sse4_1 sse4_2 x2apic popcnt tsc_deadline_timer aes xsave avx f16c rdrand lahf_lm ida arat epb pln pts dtherm tpr_shadow vnmi flexpriority ept vpid fsgsbase smep erms xsaveopt
  bugs		:
  bogomips	: 5182.68
  clflush size	: 64
  cache_alignment	: 64
  address sizes	: 36 bits physical, 48 bits virtual
  power management:

  processor	: 1
  vendor_id	: GenuineIntel
  cpu family	: 6
  model		: 58
  model name	: Intel(R) Core(TM) i7-3687U CPU @ 2.10GHz
  stepping	: 9
  microcode	: 0x15
  cpu MHz		: 3140.515
  cache size	: 4096 KB
  physical id	: 0
  siblings	: 4
  core id		: 1
  cpu cores	: 2
  apicid		: 2
  initial apicid	: 2
  fpu		: yes
  fpu_exception	: yes
  cpuid level	: 13
  wp		: yes
  flags		: fpu vme de pse tsc msr pae mce cx8 apic sep mtrr pge mca cmov pat pse36 clflush dts acpi mmx fxsr sse sse2 ss ht tm pbe syscall nx rdtscp lm constant_tsc arch_perfmon pebs bts rep_good nopl xtopology nonstop_tsc aperfmperf eagerfpu pni pclmulqdq dtes64 monitor ds_cpl vmx smx est tm2 ssse3 cx16 xtpr pdcm pcid sse4_1 sse4_2 x2apic popcnt tsc_deadline_timer aes xsave avx f16c rdrand lahf_lm ida arat epb pln pts dtherm tpr_shadow vnmi flexpriority ept vpid fsgsbase smep erms xsaveopt
  bugs		:
  bogomips	: 5182.68
  clflush size	: 64
  cache_alignment	: 64
  address sizes	: 36 bits physical, 48 bits virtual
  power management:

  processor	: 2
  vendor_id	: GenuineIntel
  cpu family	: 6
  model		: 58
  model name	: Intel(R) Core(TM) i7-3687U CPU @ 2.10GHz
  stepping	: 9
  microcode	: 0x15
  cpu MHz		: 2860.000
  cache size	: 4096 KB
  physical id	: 0
  siblings	: 4
  core id		: 0
  cpu cores	: 2
  apicid		: 1
  initial apicid	: 1
  fpu		: yes
  fpu_exception	: yes
  cpuid level	: 13
  wp		: yes
  flags		: fpu vme de pse tsc msr pae mce cx8 apic sep mtrr pge mca cmov pat pse36 clflush dts acpi mmx fxsr sse sse2 ss ht tm pbe syscall nx rdtscp lm constant_tsc arch_perfmon pebs bts rep_good nopl xtopology nonstop_tsc aperfmperf eagerfpu pni pclmulqdq dtes64 monitor ds_cpl vmx smx est tm2 ssse3 cx16 xtpr pdcm pcid sse4_1 sse4_2 x2apic popcnt tsc_deadline_timer aes xsave avx f16c rdrand lahf_lm ida arat epb pln pts dtherm tpr_shadow vnmi flexpriority ept vpid fsgsbase smep erms xsaveopt
  bugs		:
  bogomips	: 5182.68
  clflush size	: 64
  cache_alignment	: 64
  address sizes	: 36 bits physical, 48 bits virtual
  power management:

  processor	: 3
  vendor_id	: GenuineIntel
  cpu family	: 6
  model		: 58
  model name	: Intel(R) Core(TM) i7-3687U CPU @ 2.10GHz
  stepping	: 9
  microcode	: 0x15
  cpu MHz		: 2813.585
  cache size	: 4096 KB
  physical id	: 0
  siblings	: 4
  core id		: 1
  cpu cores	: 2
  apicid		: 3
  initial apicid	: 3
  fpu		: yes
  fpu_exception	: yes
  cpuid level	: 13
  wp		: yes
  flags		: fpu vme de pse tsc msr pae mce cx8 apic sep mtrr pge mca cmov pat pse36 clflush dts acpi mmx fxsr sse sse2 ss ht tm pbe syscall nx rdtscp lm constant_tsc arch_perfmon pebs bts rep_good nopl xtopology nonstop_tsc aperfmperf eagerfpu pni pclmulqdq dtes64 monitor ds_cpl vmx smx est tm2 ssse3 cx16 xtpr pdcm pcid sse4_1 sse4_2 x2apic popcnt tsc_deadline_timer aes xsave avx f16c rdrand lahf_lm ida arat epb pln pts dtherm tpr_shadow vnmi flexpriority ept vpid fsgsbase smep erms xsaveopt
  bugs		:
  bogomips	: 5182.68
  clflush size	: 64
  cache_alignment	: 64
  address sizes	: 36 bits physical, 48 bits virtual
  power management:

</pre></li>

<li><p>
Compiler version
</p>
<div class="org-src-container">
<pre class="src src-shell">  gcc --version
</pre>
</div>

<pre class="example">
gcc (Debian 5.3.1-6) 5.3.1 20160114
Copyright (C) 2015 Free Software Foundation, Inc.
This is free software; see the source for copying conditions.  There is NO
warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.


</pre></li>

<li><p>
Libpmfr version:
</p>
<div class="org-src-container">
<pre class="src src-shell">  apt-cache show libmpfr-dev  
</pre>
</div>

<pre class="example">
  Package: libmpfr-dev
  Source: mpfr4
  Version: 3.1.5-1
  Installed-Size: 1029
  Maintainer: Debian GCC Maintainers &lt;debian-gcc@lists.debian.org&gt;
  Architecture: amd64
  Replaces: libgmp3-dev (&lt;&lt; 4.1.4-3)
  Depends: libgmp-dev, libmpfr4 (= 3.1.5-1)
  Suggests: libmpfr-doc
  Breaks: libgmp3-dev (&lt;&lt; 4.1.4-3)
  Description-en: multiple precision floating-point computation developers tools
   This development package provides the header files and the symbolic
   links to allow compilation and linking of programs that use the libraries
   provided in the libmpfr4 package.
   .
   MPFR provides a library for multiple-precision floating-point computation
   with correct rounding.  The computation is both efficient and has a
   well-defined semantics. It copies the good ideas from the
   ANSI/IEEE-754 standard for double-precision floating-point arithmetic
   (53-bit mantissa).
  Description-md5: a2580b68a7c6f1fcadeefc6b17102b32
  Multi-Arch: same
  Homepage: http://www.mpfr.org/
  Tag: devel::lang:c, devel::library, implemented-in::c, role::devel-lib,
   suite::gnu
  Section: libdevel
  Priority: optional
  Filename: pool/main/m/mpfr4/libmpfr-dev_3.1.5-1_amd64.deb
  Size: 207200
  MD5sum: e5c7872461f263e27312c9ef4f4218b9
  SHA256: 279970e210c7db4e2550f5a3b7abb2674d01e9f0afd2a4857f1589a6947e0cbd

</pre></li>
</ul>
</div>
</div>

<div id="outline-container-org681a464" class="outline-4">
<h4 id="org681a464"><span class="section-number-4">1.1.3</span> A first measurement</h4>
<div class="outline-text-4" id="text-1-1-3">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #006FE0;">cd</span> /tmp/
gcc -O3 a.c -o a
./a 1000
</pre>
</div>

<pre class="example">
matrix product took 680ms
t=9062.368470

</pre>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #006FE0;">cd</span> /tmp/
gcc -O3 d.c -o d -lmpfr
./d 1000 53
</pre>
</div>

<pre class="example">
MPFR library: 3.1.5
MPFR header: 3.1.5 (based on 3.1.5)
matrix product took 74460ms
t=9062.368470

</pre>

<p>
Et donc, chez moi, le ratio est plutôt de
</p>
<div class="org-src-container">
<pre class="src src-R">74460/844
</pre>
</div>

<pre class="example">
[1] 88.22275

</pre>
</div>
</div>
