Test/test.html

<div id="outline-container-org42e0b70" class="outline-4">
<h4 id="org42e0b70"><span class="section-number-4">1.1.4</span> A second measurement</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
Ceci étant dit, si je reexécute ces deux codes:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #006FE0;">cd</span> /tmp/
gcc -O3 a.c -o a
./a 1000
</pre>
</div>

<pre class="example">
matrix product took 676ms
t=9062.368470

</pre>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #006FE0;">cd</span> /tmp/
gcc -O3 d.c -o d -lmpfr
./d 1000 53
</pre>
</div>

<pre class="example">
MPFR library: 3.1.5
MPFR header: 3.1.5 (based on 3.1.5)
matrix product took 68732ms
t=9062.368470

</pre>

<p>
J'obtiens une valeur assez différente qui me donnerait cette fois ci
un ratio de
</p>
<div class="org-src-container">
<pre class="src src-R">68732/676
</pre>
</div>

<pre class="example">
[1] 101.6746

</pre>

<p>
c'est à dire "plus proche" de ce qui est annoncé dans [2] mais c'est
un coup de chance, j'aurais tout aussi bien pu obtenir 120 !  Bref,
c'est pas le même setup que vous mais statistiquement parlant, il doit
aussi y avoir quelque chose à faire là, non ?
</p>
</div>
</div>
</div>

<div id="outline-container-org7c6e629" class="outline-3">
<h3 id="org7c6e629"><span class="section-number-3">1.2</span> References</h3>
<div class="outline-text-3" id="text-1-2">
<p>
[1] Fousse, L., Hanrot, G., Lefèvre, V., Pélissier, P., and
Zimmermann, P. MPFR: A multiple-precision binary floating- point
library with correct rounding. ACM Trans. Math. Softw. 33, 2 (2007),
article 13.
</p>

<p>
[2] van der Hoeven, J. Multiple precision floating-point arithmetic on
SIMD processors. In Proceedings of Arith’24 (2017), IEEE, pp. 2–9.
</p>

<p>
Entered on <span class="timestamp-wrapper"><span class="timestamp">[2017-09-01 Fri 17:12]</span></span>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Paul Zimmermann (reproduction with org-mode by Arnaud Legrand)</p>
<p class="date">Created: 2018-11-28 Wed 11:55</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
